 # DO NOT RUN ALL THE CELLS. THE DATABASE TABLES WILL GET AFFECTED

Master the SQL Queries to the fullest extent. The code snippets that follow are based on the data tables from the Orielly Book "SQL Cookbook_ Query Solutions and Techniques for All SQL Users"

Tables used in their examples are created by another programmer, which I have taken for using it in the examples provided in the book. Idea is to use this note book as a reference. Since it is following a cook book that is practical, there will be many lessons to be learnt and remembered.

Tables are created inside the database.

a) EMP
b) DEPT

Pivot Tables

T1, T10 and T100

In [2]:
# To setup the sql server with the database having the tables mentioned by the book. 
import sqlite3
from sqlite3 import Error


def create_connection(db_file):
    """ create a database connection to a SQLite database """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
    finally:
        if conn:
            conn.close()

In [2]:
create_connection(r"C:\WorkFiles\WPy64-37120\notebooks\Datagathering_Automation\master-sql\Orielly_database.db")

2.6.0

!pip install ipython-sql

The activities done with the SQL can be done with the dataset library itself. In order to learn the process and know another way if dataset library doesnt work.

In [3]:
import sqlalchemy
sqlalchemy.create_engine('sqlite:///Orielly_database.db')

Engine(sqlite:///Orielly_database.db)

In [6]:
%load_ext sql

In [7]:
%sql sqlite:///Orielly_database.db

In [9]:
%%sql 

SELECT *
FROM EMP

 * sqlite:///Orielly_database.db
Done.

[(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '1981-2-20', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '1981-2-22', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '1981-4-2', 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '1981-9-28', 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '1981-5-1', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7698, 'BLAKE', 'MANAGER', 7839, '1981-5-1', 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '1981-9-8', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, '1982-1-23', 1300, None, 10),
 (7900, 'JAMES', 'CLERK', 7698, '1981-12-3', 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, '1981-12-3', 3000, None, 20)]

In [10]:
result = %sql SELECT * FROM EMP 
type(result)

 * sqlite:///Orielly_database.db
Done.

sql.run.ResultSet

In [11]:
df = result.DataFrame()

In [17]:
df.head()

   EMPNO   ENAME       JOB   MGR    HIREDATE   SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902  1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698   1981-2-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698   1981-2-22  1250   500.0      30
3   7566   JONES   MANAGER  7839    1981-4-2  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698   1981-9-28  1250  1400.0      30

In [19]:
%%sql #Multiple data needs to be inserted. However the INSERT will work only one per query
INSERT INTO EMP (EMPNO, ENAME, JOB, MGR, HIREDATE, SAL, COMM, DEPTNO) 
VALUES (7698, 'BLAKE',  'MANAGER',   7839,
        '1981-5-1',  2850, NULL, 30)

 * sqlite:///Orielly_database.db
1 rows affected.

[]

In [32]:
%%sql #Table creation
CREATE TABLE DEPT
       (DEPTNO integer,
        DNAME VARCHAR(14),
        LOC VARCHAR(13) )

 * sqlite:///Orielly_database.db
Done.

[]

In [33]:
%%sql #Adding data to the tables
INSERT INTO DEPT VALUES (10, 'ACCOUNTING', 'NEW YORK')

 * sqlite:///Orielly_database.db
1 rows affected.

[]

In [37]:
%%sql

SELECT *
FROM DEPT

 * sqlite:///Orielly_database.db
Done.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (40, 'OPERATIONS', 'BOSTON'),
 (30, 'SALES', 'CHICAGO'),
 (20, 'RESEARCH', 'DALLAS')]

In [41]:
%%sql
CREATE TABLE T100 (ID INTEGER)

 * sqlite:///Orielly_database.db
Done.

[]

In [ ]:
INSERT INTO T1 VALUES (1) #Inserting one value to the ID

In [45]:
import dataset # Bringing in the dataset library

db = dataset.connect('sqlite:///Orielly_database.db') # COnnecting

In [70]:
[x for x in range(1,11)]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [76]:
for item in range(1,11):
    db['T10'].insert({'ID':item}) #Once the table schema is created, then the data add can be done

In [77]:
for item in range(1,101):
    db['T100'].insert({'ID':item}) #Here it is done for 100 rows

### Even though dataset library can be used for accessing the database and entering the data into it, the following codes will all be SQL query languge only.

In [12]:
trial = %sql SELECT ID FROM T100 WHERE ID > 20
trial[:1] #Using the single % magic is more convenient to check the results

 * sqlite:///Orielly_database.db
Done.

[(21,)]

In [13]:
def create_table():
    c.execute('CREATE TABLE IF NOT EXISTS RecordONE (Number REAL, Name TEXT)')
 
def data_entry():
    number = 1234
    name = "GeeksforGeeks"
    c.execute("INSERT INTO RecordONE (Number, Name) VALUES(?, ?)", (number, name))
    conn.commit()

def query_table():
    return c.execute("SELECT EMPNO, ENAME FROM EMP WHERE JOB = 'MANAGER'").fetchall()

def query_gen(query_input):
    return c.execute(query_input).fetchall() #Each row is a list inside a list

def ret_byRow(query_input): #This method ensures the memory is not used heavily by loading by the row
    cursor = c.execute(query_input)
    for row in cursor:
              print(row) # each row is a seperate list

In [111]:
c.close()
conn.close()

In [14]:
conn_orielly = sqlite3.connect('Orielly_database.db')
c = conn_orielly.cursor()

In [15]:
query_table()

[(7566, 'JONES'),
 (7698, 'BLAKE'),
 (7782, 'CLARK'),
 (7698, 'BLAKE'),
 (7782, 'CLARK')]

In [18]:
q2 = "select * from emp where deptno = 10"
query_gen(q2)

[(7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000, None, 10),
 (7934, 'MILLER', 'CLERK', 7782, '1982-1-23', 1300, None, 10)]

The WHERE clause allows you to retrieve only rows you are interested in. If the
expression in the WHERE clause is true for any row, then that row is returned.

In [19]:
q3 = "select * from emp where deptno = 10 or comm is not null or sal <= 2000 AND deptno = 20"
query_gen(q3)

[(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '1981-2-20', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '1981-2-22', 1250, 500, 30),
 (7654, 'MARTIN', 'SALESMAN', 7698, '1981-9-28', 1250, 1400, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7782, 'CLARK', 'MANAGER', 7839, '1981-6-9', 2450, None, 10),
 (7839, 'KING', 'PRESIDENT', None, '1981-11-17', 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '1981-9-8', 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, '1982-1-23', 1300, None, 10)]

In [20]:
q1 = "select * from emp where (deptno = 10 or comm is not null or sal <= 2000) AND deptno = 20"
query_gen(q1)
#Presence of paranthesis changes the entire outcome. Since it takes subset of the data

[(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '1983-1-12', 1100, None, 20)]

In [140]:
q4 = "SELECT ENAME AS EMPLOYEENAME, SAL as SALARY FROM EMP WHERE COMM IS NULL"
query_gen(q4)

[('SMITH', 800),
 ('JONES', 2975),
 ('BLAKE', 2850),
 ('CLARK', 2450),
 ('BLAKE', 2850),
 ('CLARK', 2450),
 ('KING', 5000),
 ('ADAMS', 1100),
 ('ADAMS', 1100),
 ('MILLER', 1300),
 ('JAMES', 950),
 ('FORD', 3000)]

In [21]:

q5= "SELECT ENAME AS EMPLOYEENAME, SAL as SALARY FROM EMP WHERE COMM IS NULL"
query_gen(q5) #The alias heading is not returned by the execute function

[('SMITH', 800),
 ('JONES', 2975),
 ('BLAKE', 2850),
 ('CLARK', 2450),
 ('BLAKE', 2850),
 ('CLARK', 2450),
 ('KING', 5000),
 ('ADAMS', 1100),
 ('ADAMS', 1100),
 ('MILLER', 1300),
 ('JAMES', 950),
 ('FORD', 3000)]

In [151]:
#Aliasing cannot be used in condition before the alias is created, so creating 

q6 = "select * from (select sal as salary, comm as commission from emp) x where salary < 5000"
query_gen(q6)

[(800, None),
 (1600, 300),
 (1250, 500),
 (2975, None),
 (1250, 1400),
 (2850, None),
 (2450, None),
 (2850, None),
 (2450, None),
 (1500, 0),
 (1100, None),
 (1100, None),
 (1300, None),
 (950, None),
 (3000, None)]

In [22]:
q8 = "select ename || ' WORKS AS A ' || job as msg from emp where deptno=10"
ret_byRow(q8)

('CLARK WORKS AS A MANAGER',)
('CLARK WORKS AS A MANAGER',)
('KING WORKS AS A PRESIDENT',)
('MILLER WORKS AS A CLERK',)

In [23]:
q9 = """
select ename,sal,
    case when sal <= 2000 then 'UNDERPAID'
        when sal >= 4000 then 'OVERPAID'
        else 'OK'
        end as status
from emp
"""

In [158]:
ret_byRow(q9) #Interesting case of SWITCH

('SMITH', 800, 'UNDERPAID')
('ALLEN', 1600, 'UNDERPAID')
('WARD', 1250, 'UNDERPAID')
('JONES', 2975, 'OK')
('MARTIN', 1250, 'UNDERPAID')
('BLAKE', 2850, 'OK')
('CLARK', 2450, 'OK')
('BLAKE', 2850, 'OK')
('CLARK', 2450, 'OK')
('KING', 5000, 'OVERPAID')
('TURNER', 1500, 'UNDERPAID')
('ADAMS', 1100, 'UNDERPAID')
('ADAMS', 1100, 'UNDERPAID')
('MILLER', 1300, 'UNDERPAID')
('JAMES', 950, 'UNDERPAID')
('FORD', 3000, 'OK')

In [24]:
q10 = "select * from emp limit 5"
query_gen(q10)

[(7369, 'SMITH', 'CLERK', 7902, '1980-12-17', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '1981-2-20', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '1981-2-22', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '1981-4-2', 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '1981-9-28', 1250, 1400, 30)]

In [27]:
q11 = "select ename,job from emp order by random() limit 5"
#getting random rows, remember to use 'random()'
query_gen(q11)

[('WARD', 'SALESMAN'),
 ('JAMES', 'CLERK'),
 ('BLAKE', 'MANAGER'),
 ('TURNER', 'SALESMAN'),
 ('BLAKE', 'MANAGER')]

In [28]:
q12 = "select case when comm is not null then comm else 0 end from emp"
query_gen(q12) #Easier option is to use COALSCE

[(0,),
 (300,),
 (500,),
 (0,),
 (1400,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,)]

In [30]:
q_co = "SELECT COALESCE(COMM,0) FROM EMP"
query_gen(q_co)

[(0,),
 (300,),
 (500,),
 (0,),
 (1400,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,)]

In [31]:
#selecting the values with some strings. T

q13 = "SELECT ename, job FROM emp WHERE deptno IN (10,20) AND (ename like '%I%' or job like '%ER')"
query_gen(q13)

[('SMITH', 'CLERK'),
 ('JONES', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('KING', 'PRESIDENT'),
 ('MILLER', 'CLERK')]

In [34]:
q14="select ename,job,sal from emp where deptno = 10 order by sal desc"
q15="select ename,job,sal,deptno from emp order by deptno,sal desc"
query_gen(q14)

[('KING', 'PRESIDENT', 5000),
 ('CLARK', 'MANAGER', 2450),
 ('CLARK', 'MANAGER', 2450),
 ('MILLER', 'CLERK', 1300)]

In [35]:
query_gen(q15)

[('KING', 'PRESIDENT', 5000, 10),
 ('CLARK', 'MANAGER', 2450, 10),
 ('CLARK', 'MANAGER', 2450, 10),
 ('MILLER', 'CLERK', 1300, 10),
 ('FORD', 'ANALYST', 3000, 20),
 ('JONES', 'MANAGER', 2975, 20),
 ('ADAMS', 'CLERK', 1100, 20),
 ('ADAMS', 'CLERK', 1100, 20),
 ('SMITH', 'CLERK', 800, 20),
 ('BLAKE', 'MANAGER', 2850, 30),
 ('BLAKE', 'MANAGER', 2850, 30),
 ('ALLEN', 'SALESMAN', 1600, 30),
 ('TURNER', 'SALESMAN', 1500, 30),
 ('WARD', 'SALESMAN', 1250, 30),
 ('MARTIN', 'SALESMAN', 1250, 30),
 ('JAMES', 'CLERK', 950, 30)]

In [36]:
#sorting based on the substrings
q16 = "select ename,job from emp order by substr(job,length(job)-1)"
query_gen(q16)

[('ALLEN', 'SALESMAN'),
 ('WARD', 'SALESMAN'),
 ('MARTIN', 'SALESMAN'),
 ('TURNER', 'SALESMAN'),
 ('JONES', 'MANAGER'),
 ('BLAKE', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('BLAKE', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('KING', 'PRESIDENT'),
 ('SMITH', 'CLERK'),
 ('ADAMS', 'CLERK'),
 ('ADAMS', 'CLERK'),
 ('MILLER', 'CLERK'),
 ('JAMES', 'CLERK'),
 ('FORD', 'ANALYST')]

In [52]:
%%sql
CREATE VIEW V AS select ename||' '||deptno as data from emp

 * sqlite:///Orielly_database.db
Done.

[]

In [53]:
%%sql
SELECT * 
FROM V

 * sqlite:///Orielly_database.db
Done.

[('SMITH 20',),
 ('ALLEN 30',),
 ('WARD 30',),
 ('JONES 20',),
 ('MARTIN 30',),
 ('BLAKE 30',),
 ('CLARK 10',),
 ('BLAKE 30',),
 ('CLARK 10',),
 ('KING 10',),
 ('TURNER 30',),
 ('ADAMS 20',),
 ('ADAMS 20',),
 ('MILLER 10',),
 ('JAMES 30',),
 ('FORD 20',)]

Above view creates a new table itself in the database, with name "V". Then that table can be queried as a regular table.
Important point is, if the table already exists then it will throw error. Drop View deletes the tables

In [51]:
%%sql
DROP VIEW V;

 * sqlite:///Orielly_database.db
Done.

[]

In [55]:
q17 = "select data from V order by replace(translate(data,'0123456789','##########'),'#','')"
#The above query will not work with SQLite since Replace and Translate are not supported

In [56]:
#THis query uses the column with null values to order the output

q19  = "select ename,sal,comm from (select ename,sal,comm, case when comm is null then 0 else 1 end as is_null from emp) x order by is_null,comm"

In [57]:
query_gen(q19)

[('SMITH', 800, None),
 ('JONES', 2975, None),
 ('BLAKE', 2850, None),
 ('CLARK', 2450, None),
 ('BLAKE', 2850, None),
 ('CLARK', 2450, None),
 ('KING', 5000, None),
 ('ADAMS', 1100, None),
 ('ADAMS', 1100, None),
 ('MILLER', 1300, None),
 ('JAMES', 950, None),
 ('FORD', 3000, None),
 ('TURNER', 1500, 0),
 ('ALLEN', 1600, 300),
 ('WARD', 1250, 500),
 ('MARTIN', 1250, 1400)]

In [58]:
q20= "select ename,sal,job,comm, case when job = 'SALESMAN' then comm+sal else sal end as ordered from emp order by 5"
query_gen(q20)

#The case clause can be used conditionally create a new column in the query. The table is not touched

[('SMITH', 800, 'CLERK', None, 800),
 ('JAMES', 950, 'CLERK', None, 950),
 ('ADAMS', 1100, 'CLERK', None, 1100),
 ('ADAMS', 1100, 'CLERK', None, 1100),
 ('MILLER', 1300, 'CLERK', None, 1300),
 ('TURNER', 1500, 'SALESMAN', 0, 1500),
 ('WARD', 1250, 'SALESMAN', 500, 1750),
 ('ALLEN', 1600, 'SALESMAN', 300, 1900),
 ('CLARK', 2450, 'MANAGER', None, 2450),
 ('CLARK', 2450, 'MANAGER', None, 2450),
 ('MARTIN', 1250, 'SALESMAN', 1400, 2650),
 ('BLAKE', 2850, 'MANAGER', None, 2850),
 ('BLAKE', 2850, 'MANAGER', None, 2850),
 ('JONES', 2975, 'MANAGER', None, 2975),
 ('FORD', 3000, 'ANALYST', None, 3000),
 ('KING', 5000, 'PRESIDENT', None, 5000)]

In [67]:
%%sql
"select ename, deptno from emp where deptno = 10"

 * sqlite:///Orielly_database.db
(_sqlite3.OperationalError) near ""select ename, deptno from emp where deptno = 10"": syntax error
[SQL: "select ename, deptno from emp where deptno = 10"]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [74]:
%%sql

select ename as ename_and_dname, deptno from emp where deptno = 10 union all select '------------',null from T1 union all select dname,deptno from dept

 * sqlite:///Orielly_database.db
Done.

[('CLARK', 10),
 ('CLARK', 10),
 ('KING', 10),
 ('MILLER', 10),
 ('------------', None),
 ('ACCOUNTING', 10),
 ('OPERATIONS', 40),
 ('SALES', 30),
 ('RESEARCH', 20)]

In [71]:
q21 = "select ename as ename_and_dname, deptno from emp where deptno = 10 union all select '-----',null from T1 union all select dname,deptno from dept"
query_gen(q21)

#The number of columns and the data types should match, else UNION will fail
#You wouldnâ€™t use DISTINCT in a query unless you had to, and the same rule applies for UNION:

[('CLARK', 10),
 ('CLARK', 10),
 ('KING', 10),
 ('MILLER', 10),
 ('-----', None),
 ('ACCOUNTING', 10),
 ('OPERATIONS', 40),
 ('SALES', 30),
 ('RESEARCH', 20)]